# Создать список и заполнить его элементами различных
# типов данных. Реализовать скрипт проверки типа данных
# каждого элемента. Использовать функцию type() для
# проверки типа. Элементы списка можно не запрашивать у
# пользователя, а указать явно, в программе.

list = ['abc', 343, [444], 1.22]
for a in list:
    print(type(a))
